<%@ Page Language="C#" AutoEventWireup="true" CodeBehind="Main.aspx.cs" Inherits="students.Main" MasterPageFile="~/main.Master" %>




<asp:Content ID="MainContent" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
    <div class="task">
    Создать Web-приложение, реализующее простую систему учета успеваемости студентов по дисциплине обучения.
Дизайн на усмотрение разработчика.<br />
Основная функциональность:<br />
−	Информация о студентах должна храниться в базе данных<br />
−	Данных о студентах (в том числе о баллах студента) должны заноситься пользователем программы<br />
Дополнительные возможности:<br />
−	Реализовать возможность подсчета суммы баллов <br />
−	Реализовать просмотр пяти лучших и худших студентов <br />
−	Реализовать защиту полей ввода от ошибок<br />
−	Веб-сайт должен состоять из нескольких страниц, использовать мастер страницу и реализовать навигацию на сайте на основе мастер-страницы<br />
        </div>
</asp:Content>
  

